;12 :	int main() {
0x40147e	push   %ebp
0x40147f	mov    %esp,%ebp
0x401481	and    $0xfffffff0,%esp
0x401484	sub    $0x30,%esp
0x401487	call   0x401a70 <__main>
;14 :		float x=10;
0x40148c	flds   0x405070 //запись в стек сопроцессора значения, заданного адресом памяти
0x401492	fstps  0x2c(%esp)  //сохранение вещ знач с извлечением из стека
;15 :		float y1=0;
0x401496	fldz  // запись в стек константы +0.0
0x401498	fstps  0x28(%esp)  //сохранение константы с извлечением из стека
;30 :	    y1=func(x);
0x40149c	flds   0x2c(%esp)  //запись в стек сопроцессора значения х
0x4014a0	fstps  (%esp) //сохранение вещ знач с извлечением из стека
0x4014a3	call   0x401460 <func(float)> // вызов функции
0x4014a8	fstps  0x1c(%esp) //сохранение результата 
0x4014ac	mov    0x1c(%esp),%eax //перенос результата из стека в «аккумулятор»
0x4014b0	mov    %eax,0x28(%esp) //перенос  результата в у1
;32 :		system("Pause");
0x4014b4	movl   $0x405065,(%esp)
0x4014bb	call   0x403af8 <system>
;33 :		return 0;
0x4014c0	mov    $0x0,%eax
;34 :	}
0x4014c5	leave
0x4014c6	ret
